
* CCA

#+begin_src ipython
from mvlearn.embed import MCCA
mcca = MCCA(n_components=3, regs='oas')

X= np.array(X_mouse[0])

X_reshaped = np.transpose(X, (0,1,3,2))
X_reshaped = X_reshaped.reshape(X.shape[0], X.shape[1]*X.shape[3], X.shape[2])

X_cca = mcca.fit_transform(X_reshaped)
X_reshaped = X_cca.reshape(X.shape[0], X.shape[1], X.shape[3], 3)
X_reshaped = np.transpose(X_reshaped, (0, 1, 3, 2))

pcs = np.array(mcca.loadings_)
#+end_src

#+RESULTS:
: (7, 5, 3)

#+begin_src ipython
i_mouse = 3
z_lim = 10

X = X_reshaped[i_mouse]
y = y_mouse[0][i_mouse]

print(options['mice'][i_mouse], 'day', options['days'][i_day], 'X', X.shape, 'y', y.shape, 'pcs', pcs.shape)
#+end_src

#+RESULTS:
: JawsM15 day last X (96, 3, 84) y (96, 18) pcs (7, 5, 3)

